## Data cleaning and connect to mysql

#### Import libraries

In [3]:
import pandas as pd
import seaborn as sns

# mysql
import pymysql # Adaptor
from sqlalchemy import create_engine

### Load dataset

In [5]:
data = pd.read_csv('Walmart.csv')

In [8]:
data.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [10]:
data.shape

(10051, 11)

### Remove $ sign from unit_price column and convert it to int data type

In [13]:
data['unit_price'] = data['unit_price'].str.replace('$','').astype(float)

In [15]:
data.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

### Rmove duplicated if any

In [18]:
data.duplicated().sum()

51

In [20]:
data = data.drop_duplicates()

In [22]:
data.shape

(10000, 11)

### Check null and remove if any

In [25]:
data.isnull().sum()

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

In [27]:
data.dropna(inplace=True)

In [29]:
data.shape

(9969, 11)

### Calculate total Sales

In [32]:
data['total_sales'] = data['unit_price'] * data['quantity']

In [34]:
data.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,total_sales
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48,604.17

### Uderstand the statistical value of numeric column

In [37]:
data.describe()

,invoice_id,unit_price,quantity,rating,profit_margin,total_sales
count,9969.000000,9969.000000,9969.000000,9969.000000,9969.000000,9969.000000
mean,5010.116561,50.622142,2.355602,5.828839,0.393744,121.348819
std,2886.217349,21.203766,1.605455,1.763723,0.090659,112.678040
min,1.000000,10.080000,1.000000,3.000000,0.180000,10.170000
25%,2524.000000,32.000000,1.000000,4.000000,0.330000,54.000000
50%,5016.000000,51.000000,2.000000,6.000000,0.330000,88.000000
75%,7508.000000,69.000000,3.000000,7.000000,0.480000,156.000000
max,10000.000000,99.960000,10.000000,10.000000,0.570000,993.000000

In [39]:
data.to_csv('walmart_final.csv', index=False) # Save cleaned dataset in csv file

### Connect to Mysql

In [42]:
from urllib.parse import quote_plus

In [44]:
password = "123@Sokho@123"
password_encoded = quote_plus(password)
mysql_engine = create_engine(f"mysql+pymysql://root:{password_encoded}@localhost:3306/walmart_data")

try:
    mysql_engine
    print('Successfylly connected to mysql')
except:
    print('Unable to connect')

Successfylly connected to mysql

In [46]:
data.to_sql(name='walmart', con=mysql_engine, if_exists='append', index=False)

9969